micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_pwr.c
    [..]
      After any application reset or system reset, the PWR does not filter any access
      (default configuration: non-secure, any privileged) until the trusted agent has
      programmed the security and privileged protection.

    [..] Secure/non-secure access filtering
      To enable the filtering access based on this attribute, the authorized master
      agent must set SECx in PWR_SECCFGR related to the PWR feature.

      When a register is configured as secure, read and write operations are only
      allowed by a secure access.
      Non-secure read or write accesses are denied (RAZ/WI).
      An illegal secure access event is generated to the IAC (illegal access controller).
      There is no bus error generated.
      When a register is configured as non-secure, read and write operations are
      allowed by both secure and non-secure accesses.

    [..] Privileged/unprivileged access filtering
      To enable the filtering access based on this attribute, the authorized master
      agent has to set PRIVx in PWR_PRIVCFGR related to the PWR feature.
      When a register is configured as privileged, read and write operations are only
      allowed by a privileged access.
      Unprivileged read or write accesses are denied (RAZ/WI).
      An illegal privileged access event is generated to the IAC.
      There is no bus error generated.
      When a register is configured as unprivileged, read and write operations are
      allowed by both privileged and unprivileged accesses.

@endverbatim
  * @{
  */

/**
  * @brief  Configure the PWR item attributes.
  * @note   Available attributes are security and privilege protection.
  * @note   Security attribute can only be set only by secure access.
  * @note   Privilege attribute for secure items can be managed only by a secure
  *         privileged access.
  * @note   Privilege attribute for nsecure items can be managed  by a secure
  *         privileged access or by a nsecure privileged access.
  * @param  Item       : Specifies the item(s) to set attributes on.
  *                      This parameter can be a combination of PWR_ITEMS.
  * @param  Attributes : Specifies the available attribute(s).
  *                      This parameter can be one of PWR_ATTRIBUTES.
  * @retval None.
  */
void HAL_PWR_ConfigAttributes(uint32_t Item, uint32_t Attributes)
{
  /* Check the parameters */
  assert_param(IS_PWR_ITEMS_ATTRIBUTES(Item));
  assert_param(IS_PWR_ATTRIBUTES(Attributes));

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  /* Secure item management (TZEN = 1) */
  if ((Attributes & PWR_ITEM_ATTR_SEC_PRIV_MASK) == PWR_ITEM_ATTR_SEC_PRIV_MASK)
  {
    /* Privilege item management */
    if ((Attributes & PWR_SEC_PRIV) == PWR_SEC_PRIV)
    {
      SET_BIT(PWR_S->SECCFGR, Item);
      SET_BIT(PWR->PRIVCFGR, Item);
    }
    else
    {
      SET_BIT(PWR_S->SECCFGR, Item);
      CLEAR_BIT(PWR->PRIVCFGR, Item);
    }
  }
  /* NSecure item management */
  else
  {
    /* Privilege item management */
    if ((Attributes & PWR_NSEC_PRIV) == PWR_NSEC_PRIV)
    {
      CLEAR_BIT(PWR_S->SECCFGR, Item);
      SET_BIT(PWR->PRIVCFGR, Item);
    }
    else
    {
      CLEAR_BIT(PWR_S->SECCFGR, Item);
      CLEAR_BIT(PWR->PRIVCFGR, Item);
    }
  }
#else
  /* NSecure item management (TZEN = 0) */
  if ((Attributes & PWR_ITEM_ATTR_NSEC_PRIV_MASK) == PWR_ITEM_ATTR_NSEC_PRIV_MASK)
  {
    /* Privilege item management */
    if ((Attributes & PWR_NSEC_PRIV) == PWR_NSEC_PRIV)
    {
      SET_BIT(PWR->PRIVCFGR, Item);
    }
    else
    {
      CLEAR_BIT(PWR->PRIVCFGR, Item);
    }
  }
#endif /* __ARM_FEATURE_CMSE */
}


/**
  * @brief  Get attribute(s) of a PWR item.
  * @param  Item        : Specifies the item(s) to get attributes on.
  *                       This parameter can be one of PWR_ITEMS.
  * @param  pAttributes : Pointer to return attribute(s).
  *                       Returned value could be on of PWR_ATTRIBUTES.
  * @retval HAL Status.
  */
HAL_StatusTypeDef HAL_PWR_GetConfigAttributes(uint32_t Item, uint32_t *pAttributes)
{
  uint32_t attributes;

  /* Check attribute pointer */
  if (pAttributes == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameter */
  assert_param(IS_PWR_ITEMS_ATTRIBUTES(Item));

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)

  /* Check item security */
  if ((PWR->SECCFGR & Item) == Item)
  {
    if ((PWR->PRIVCFGR & Item) == Item)
    {
      attributes = PWR_SEC_PRIV;
    }
    else
    {
      attributes = PWR_SEC_NPRIV;
    }
  }
  else
  {
    if ((PWR->PRIVCFGR & Item) == Item)
    {
      attributes = PWR_NSEC_PRIV;
    }
    else
    {
      attributes = PWR_NSEC_NPRIV;
    }
  }
#else
  if ((PWR->PRIVCFGR & Item) == Item)
  {
    attributes = PWR_NSEC_PRIV;
  }
  else
  {
    attributes = PWR_NSEC_NPRIV;
  }
#endif /* __ARM_FEATURE_CMSE */

  /* return value */
  *pAttributes = attributes;

  return HAL_OK;
}
/**
  * @}
  */
#endif /* #if defined(PWR_PRIVCFGR_PRIV0) */

/**
  * @}
  */
#endif /* defined (HAL_PWR_MODULE_ENABLED) */
/**
  * @}
  */

/**
  * @}
  */

